app/controllers/admin/collections_controller.rb

SELECT  `collections`.* FROM `collections`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `collections`
---
  def index
    @collections = Collection.all.paginate(page: params[:page], per_page: 30)

SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1 LIMIT 1
---
  def manage_products
    @collection = Collection.find(params[:id])

INSERT INTO `collections` (`created_at`, `long_description`, `name`, `short_description`, `updated_at`) VALUES ('2014-06-20 18:52:09', '111', '12312', '122', '2014-06-20 18:52:09')
---
  def create
    @collection = Collection.new(collection_params)
    if @collection.save

SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products`   ORDER BY name ASC
SELECT  `products`.* FROM `products`   ORDER BY name ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `products`
---
  def edit
    @collection = Collection.find(params[:id])
    @search = Product.search(params[:q])
    @products = @search.result.order('name ASC').paginate(:page => params[:page], :per_page => 10)

SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1 LIMIT 1
UPDATE `collections` SET `active` = 1, `updated_at` = '2014-06-20 19:10:08' WHERE `collections`.`id` = 1
---
  def update
    @collection = Collection.find(params[:id])
    if @collection.update_attributes(collection_params)

SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1 LIMIT 1
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 23  ORDER BY name ASC LIMIT 1
SELECT  1 AS one FROM `products` INNER JOIN `collections_products` ON `products`.`id` = `collections_products`.`product_id` WHERE `collections_products`.`collection_id` = 1 AND `products`.`id` = 26 LIMIT 1
SELECT `products`.* FROM `products` INNER JOIN `collections_products` ON `products`.`id` = `collections_products`.`product_id` WHERE `collections_products`.`collection_id` = 1  ORDER BY name ASC, products.name
---
  def add_products
    return unless params[:product_ids].present?
    @collection = Collection.find(params[:id])
    params[:product_ids].each do |product_id|
      product = Product.find(product_id)
      @collection.products << product unless @collection.products.include?(product)

SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1 LIMIT 1
SELECT  `collections_products`.* FROM `collections_products`  WHERE `collections_products`.`product_id` = 25 AND `collections_products`.`collection_id` = 1 LIMIT 1
DELETE FROM `collections_products` WHERE `collections_products`.`id` = 2
---
  def remove_products
    return unless params[:product_ids].present?
    @collection = Collection.find(params[:id])
    params[:product_ids].each do |product_id|
      association = CollectionsProduct.find_by(product_id: product_id, collection_id: @collection.id)
      association.destroy